&НаКлиентеПроцедура изображениеНажатие(Элемент, СтандартнаяОбработка)  СтандартнаяОбработка = Ложь;   Режим = РежимДиалогаВыбораФайла.Открытие;   ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);   ДиалогОткрытия.ПолноеИмяФайла = "";   Фильтр = "Файл Jpg (*.jpg)|*.jpg";   ДиалогОткрытия.Фильтр = Фильтр;   ДиалогОткрытия.МножественныйВыбор = Ложь;   ДиалогОткрытия.Заголовок = "Выберете файл для загрузки";   ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма);   ДиалогОткрытия.Показать(ОписаниеОповещения);  КонецПроцедуры&НаКлиенте Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт   Если ВыбранныйФайл = Неопределено Тогда     Возврат;   КонецЕсли;   ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма);   НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); КонецПроцедуры&НаКлиенте Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт   Если Не Результат Тогда     Возврат;   КонецЕсли;   СсылкаНаКартинку = Адрес;   Модифицированность = Истина; КонецПроцедуры&НаСервереПроцедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда     ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку);     ТекущийОбъект.Фото = Новый ХранилищеЗначения(ФайлКартинки);     УдалитьИзВременногоХранилища(СсылкаНаКартинку);     СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фото");   КонецЕсли;КонецПроцедуры&НаСервереПроцедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фото");КонецПроцедуры 


&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если Объект.ДействующаяСкидка <> 0 Тогда   
		ЭтаФорма.РеальнаяЦена = Число(Объект.Цена) - Число(Объект.Цена) / 100 * Объект.ДействующаяСкидка;
		Элементы.Цена.ЦветТекста = WebЦвета.Красный; 
		Элементы.Цена.Шрифт = Новый Шрифт(Элементы.Цена.Шрифт,,,,,,Истина);
	КонецЕсли;
	
		
	ПриОткрытииНаСервере();
КонецПроцедуры

